#Q1

1)pd.read_csv = This function is used to rea data from a csv filr and create a dataframe.
import pandas as pd
df = pd.read_csv("data.csv")
print(df)

2)df.head()= this function is use to display first five rows(by default) of the data frame.

In [3]:
import pandas as pd
df = pd.DataFrame({"A": [1, 2, 3, 4, 5], "B": [10, 20, 30, 40, 50]})
df.head()

   A   B
0  1  10
1  2  20
2  3  30
3  4  40
4  5  50

In [4]:
# 3) df.info() = this function provides a summary of dataframe, including the data types of columns and the number of non-null values
df1 = pd.DataFrame({"Name" : ["Ironman", "Captain America", "Thor Odinson"],
                   "Age":[50, 90, 1000],
                   "City": ["California", "Washington DC", "Midgard(Earth)"]})

In [5]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   City    3 non-null      object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

df.tail() - it is similar to head, it gives the last 5 values by default.

In [6]:
df1.tail()

              Name   Age            City
0          Ironman    50      California
1  Captain America    90   Washington DC
2     Thor Odinson  1000  Midgard(Earth)

In [7]:
#Q2
df = pd.DataFrame({"A": [1,2,3,4],"B":[5,6,7,8], "C":[9,10,11,12]})

In [8]:
def reindex_dataframe(df):
    df.index = pd.RangeIndex(start = 1, stop = len(df)*2, step = 2)
    return df

In [9]:
new_df = reindex_dataframe(df)

In [10]:
new_df

   A  B   C
1  1  5   9
3  2  6  10
5  3  7  11
7  4  8  12

In [11]:
#Q3
df1 = pd.DataFrame({"values" :[10,20,30,40,50]})

In [12]:
def sum_values(df1):
    values_column = df1["values"]
    sum_of_values = sum(values_column[:3])
    print("sum of first three values is :",sum_of_values)

In [13]:
sum_values(df1)

sum of first three values is : 60

In [14]:
#Q4 here I am taking df as  df3
pd.set_option("display.max_colwidth",1000)
df3 = pd.DataFrame({"Text": ["Hi My name is Navdeep.", "I am 19 years old and pursuing Btech in Computer Science(Data science)"]})

In [15]:
df3["Word_count"]= df3["Text"].apply(lambda x : len(x.split()))

In [16]:
df3

,Text,Word_count
0,Hi My name is Navdeep.,5
1,I am 19 years old and pursuing Btech in Computer Science(Data science),12

#Q5 
DataFrame.size() method is used to return total number of elements in the dataframe. It calculates the size by multiplying the number of rows by number of columns. this method does not take into account the data type and content of dataframe.

DataFrame.shape() method returns the number of rows and columns in the dataframe. The shape is represented as (rows, columns). It represents the dimensionality of the dataframe.

#Q6 
pd.read_excel() funtion is used to read an excel file where pd is the alias of pandas

In [17]:
#Q7 here I am taking df as df4

In [18]:
df4 = pd.DataFrame({"email": ["ironman@gmail.com", "captainamerica@gmail.com", "thor@gmail.com", "drbanner@gmail.com", "natasharomanoff@gmail.com"]})

In [19]:
df4

                       email
0          ironman@gmail.com
1   captainamerica@gmail.com
2             thor@gmail.com
3         drbanner@gmail.com
4  natasharomanoff@gmail.com

In [20]:
def username(email):
    return email.split("@")[0]

In [21]:
df4["Username"] = df4["email"].apply(username)

In [22]:
df4

                       email         Username
0          ironman@gmail.com          ironman
1   captainamerica@gmail.com   captainamerica
2             thor@gmail.com             thor
3         drbanner@gmail.com         drbanner
4  natasharomanoff@gmail.com  natasharomanoff

In [23]:
#Q8 
df5 = pd.DataFrame({"A": [3,8,6,2,9], "B": [5,2,9,3,1], "C":[1,7,4,5,2]})

In [24]:
df5

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [25]:
def selected_rows(df5):
    selected_rows = df5[ (df5["A"]>5) & (df5["B"] < 10) ]
    return selected_rows

In [26]:
new_df5 = selected_rows(df5)

In [27]:
new_df5

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

In [28]:
#Q9 considering dataframe from the last question
df5

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [29]:
df5["values"] = 3,4,5,6,7

In [30]:
df5

   A  B  C  values
0  3  5  1       3
1  8  2  7       4
2  6  9  4       5
3  2  3  5       6
4  9  1  2       7

In [31]:
df5["values"].mean()

5.0

In [32]:
df5["values"].median()

5.0

In [33]:
df5["values"].std()

1.5811388300841898

In [39]:
#Q10 
df6 = pd.DataFrame({"Sales": [100,150,200,250,300,450,500],
                   "Date":pd.date_range(start = "2023-07-29", end = "2023-08-04")})

def moving_average(df6):
    df6["Moving Average"] = df6["Sales"].rolling(window = 7, min_periods = 1).mean()
    return df6

In [40]:
new_df6 = moving_average(df6)

In [41]:
new_df6

   Sales       Date  Moving Average
0    100 2023-07-29      100.000000
1    150 2023-07-30      125.000000
2    200 2023-07-31      150.000000
3    250 2023-08-01      175.000000
4    300 2023-08-02      200.000000
5    450 2023-08-03      241.666667
6    500 2023-08-04      278.571429

In [42]:
#Q11 
df7 = pd.DataFrame({"Date":[ "2023-01-01","2023-01-02","2023-01-03","2023-01-04","2023-01-05"] })

In [43]:
df7

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05

In [44]:
def weekday(df7):
    df7["Weekday"] = pd.to_datetime(df7["Date"]).dt.day_name()
    return df7

In [45]:
new_df7 = weekday(df7)

In [46]:
new_df7

         Date    Weekday
0  2023-01-01     Sunday
1  2023-01-02     Monday
2  2023-01-03    Tuesday
3  2023-01-04  Wednesday
4  2023-01-05   Thursday

In [47]:
#Q12 
df8 = pd.DataFrame({"Date": pd.date_range(start = "2023-01-01", end = "2023-12-31")})

In [48]:
def selected_rows(df8):
    return df8[ (df8["Date"]>= "2023-01-01") & (df8["Date"]<= "2023-01-31") ]

In [49]:
new_df8 = selected_rows(df8)

In [50]:
new_df8

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05
5  2023-01-06
6  2023-01-07
7  2023-01-08
8  2023-01-09
9  2023-01-10
10 2023-01-11
11 2023-01-12
12 2023-01-13
13 2023-01-14
14 2023-01-15
15 2023-01-16
16 2023-01-17
17 2023-01-18
18 2023-01-19
19 2023-01-20
20 2023-01-21
21 2023-01-22
22 2023-01-23
23 2023-01-24
24 2023-01-25
25 2023-01-26
26 2023-01-27
27 2023-01-28
28 2023-01-29
29 2023-01-30
30 2023-01-31

#Q13

to use the basic funtions of pandas, the first and foremost step is to imort the library. In python, we can import pandas library using import keyword followed by the alias pd. This alias is commonly used in the python community and makes it easier to refer to the pandas library throughtout our code.